Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/older_and_retired_people/state_pension_contributory.html.txt.tmx
Source language: en
Languages: ga

source: The State Pension (Contributory) is paid to people from the age of 66 who have enough Irish social insurance contributions
ga: Tá an Pinsean Stáit (Ranníocach) iníoctha le daoine in Éirinn a bhfuil a ndóthain Ranníocaíochtaí Leasa Shóisialaigh íoctha acu agus a bhfuil 66 bliain slán acu

source: It is not means-tested
ga: Níl aon tástáil acmhainne i gceist

source: You can have other income and still get a State Pension (Contributory)
ga: Féadfaidh tú Pinsean Stáit (Ranníocach) a fháil agus ioncam agat ó fhoinsí eile

source: This pension is taxable but you are unlikely to pay tax if it is your only income
ga: Tá an pinsean seo inchánach ach má tá tú gan aon ioncam eile, ní miste cáin a ghearradh air

source: As the social insurance conditions are very complex you should apply for a State Pension (Contributory) if you have ever worked and have any contributions (stamps) paid at any time
ga: Tá na coinníollacha a bhaineann le hárachas sóisialta an-chasta agus ba chóir duit cur isteach ar Phinsean Stáit (Ranníocach) má tá obair agus ranníocaíocht (stampa) déanta agat uair ar bith

source: There are a number of pro-rata pensions available to people who paid different types of social insurance contributions or who did not pay contributions because of various reasons (see below). Changes are proposed to the current system in 2020 (see 'Further information' below)
ga: Tá roinnt Pinsean Stáit (Ranníocach) éagsúla pro-rata ar fáil do dhaoine atá íocaíochtaí éagsúla árachais sóisialta á déanamh acu nó atá gan aon ranníocaíocht á déanamh acu ar chúiseanna éagsúla - féach thíos

source: If you retire early, you should ensure that you continue to pay PRSI contributions or get credited contributions (if eligible) to maintain your entitlement to a pension
ga: Má théann tú ar scor go luath ba chóir duit a dhéanamh cinnte go leanann tú ar aghaidh ag déanamh na ranníocaíochtaí ÁSPC nó ranníocaíochtaí creidiúnaithe a fháil chun do theidlíocht ar phinsean a choimeád

source: If you are getting Jobseeker's Benefit (JB) and are aged between 65 and 66 when your JB would normally end, you may continue to receive it until the age of 66, provided you meet the PRSI requirements
ga: Má tá Sochar Cuardaitheora Poist (SCP) á fháil agat agus má chríochnaíonn do SCP de ghnáth nuair tá tú idir 65 agus 66 bliain d'aois, b'fhéidir go bhfaighfeá an íocaíocht go dtí aois 66 a fhad agus a chomhlíonann tú na riachtanais ÁSPC

source: The Department of Social Protection has published FAQs on Qualifying for the State Pension (Contributory) which can help you to work out whether you qualify for a State Pension (Contributory)
ga: D'fhoilsigh an Roinn Coimirce Sóisialaí, FAQs cabhróidh sé leat oibriú amach an bhfuil tú i dteideal Pinsean Stáit (Ranníocach). D’athraigh an t Acht um Athchóiriú an Dlí Leasa Shóisialaigh agus um Pinsin 2006 (pdf) ainm an Phinsean Ranníocach Seanaoise go Pinsean Stáit (Ranníocach). Tháinig an t-ainm nua i bhfeidhm an 29 Meán Fómhair, 2006

source: To qualify for a State Pension (Contributory) you must be aged 66 or over and have enough Class A, E, F,G, H, N or S social insurance contributions
ga: Ní mór duit a bheith 66 bliana d'aois agus dóthain ranníocaíochtaí árachais shóisialta Rannóige A, E, F, G, H, N nó S a bheith déanta agat le bheith i dteideal an pinsean seo a fháil

source: Have paid social insurance contributions before a certain age
ga: Ranníocaíochtaí árachais shóisialta a bheith déanta agat roimh aois áirithe

source: Have a certain number of social insurance contributions paid and
ga: Oiread áirithe ranníocaíochtaí árachais shóisialta a bheith déanta agat agus

source: Have a certain average number over the years since you first started to pay
ga: Líon áirithe díobh a bheith déanta agat ar an mheán i rith na mblianta ó thosaigh tú ag íoc don chéad uair

source: Paid insurance before a certain age
ga: An t-árachas a bheith íoctha roimh aois áirithe

source: You must have started to pay social insurance before the age of 56
ga: Caithfidh tú a bheith tagtha isteach sa scéim árachais roimh aois áirithe

source: (The age limit is higher for people born before 1922.)
ga: I gcás daoine atá faoi bhun 66 faoi láthair, caithfidh sé gur thosaigh siad ag íoc as árachas sóisialta roimh aois a 56

source: Your entry into insurance means the date on which you first started to pay social insurance
ga: Séard atá i gceist le tosú sa scéim árachais ná an dáta ar thosaigh tú ag íoc as árachas sóisialta don chéad uair

source: The rules that determine when you entered into insurance are quite complex for those with mixed insurance, that is, full social insurance for some of the time and modified at other times
ga: Tá castacht ag baint leis na rialacha a dhearbhaíonn cathain ar tháinig tú isteach sa scéim árachais má tá árachas measctha ag an té sin. Is é sin le rá go raibh lán-árachas sóisialta aige nó aici cuid den am agus árachas athraithe uaireanta eile

source: Normally the date of starting insurable employment is taken as the date of the first paid employment contribution
ga: De ghnáth glactar leis gur é an dáta tosú fostaíochta inárachais, dáta an chéad ranníocaíocht fostaíochta íoctha

source: However if you have a mixture of full- and modified-rate contributions and paid your first full-rate employment contribution before 6 April 1991 and before you reached 56 years of age, your entry into insurance can be the date on which you first started to pay the full rate of insurance if that would be to your advantage
ga: Má thosaigh tú ag íoc lán-árachais roimh 6 Aibreán 1991 agus roimh a mbíonn tú 56 bliain d'aois, glacfar leis gur tháinig tú isteach sa scéim árachais ar an dáta ar thosaigh tú ag íoc an ráta iomlán árachais - más tairbheach duit an socrú seo

source: If you started to pay full insurance after 6 April 1991, your entry into insurance is the time you first paid any social insurance
ga: Má thosaigh tú ag íoc as lán-árachas i ndiaidh an 1 Aibreán 1991, glactar leis gur tháinig tú isteach sa scéim árachais an t-am a thosaigh tú ag íoc árachais shóisialta de chineál ar bith

source: There are also special entry into insurance rules for self-employed people
ga: Tá rialacha faoi leith ann maidir le teacht isteach sa scéim árachais i gcás daoine féinfhostaithe

source: PRSI for the self-employed was first introduced on 6 April 1988. If you started to pay self-employed contributions on 6 April 1988 and had previously paid employee insurance at any time, then the date of entry into insurance can be either 6 April 1988 or the date on which you actually first paid insurance, whichever is to your advantage
ga: Má thosaigh tú ag déanamh ranníocaíochtaí féinfhostaithe ar an 6 Aibreán 1988 agus má bhí ranníocaíochtaí íoctha agat mar fhostaí uair ar bith roimhe sin, is féidir leat do rogha a dhéanamh idir an 6 Aibreán 1988 agus an chéad lá riamh ar íoc tú as árachas agus dáta is fearr a oireann duit a bheith agat

source: Number of paid contributions
ga: Líon na ranníocaíochtaí a rinneadh

source: If you reach pension age on or after April 6 2012, you need to have 520 full-rate contributions (10 years contributions)
ga: Má shroicheann tú aois an phinsin ar nó i ndiaidh 6 Aibreán 2012, ní mór duit 520 ranníocaíocht a bheith déanta agat (ranníocaíochtaí 10 mbliana)

source: In this case, only 260 of the 520 contributions may be voluntary contributions
ga: Sa chás seo, ní féidir go mbeadh níos mó ná 260 den 520 ina ranníocaíochtaí deonacha

source: However, if you were a voluntary contributor on or before April 6 1997 and you have a yearly average of 20 contributions, you may meet the requirement if you have a total of 520 full-rate contributions (of which only 156 need to be compulsory paid contributions)
ga: Más rud é, áfach, go raibh tú i do ranníocthóir deonach ar an 6 Aibreán 1997, nó roimhe, agus má tá 20 ranníocaíocht déanta ar an mheán agat in aghaidh na bliana, féadfaidh tú an riachtanas a shásamh má tá 520 ranníocaíocht déanta agat san iomlán, agus a chás sin, ní gá ach go mbeadh 156 díobh ina ranníocaíochtaí a rinneadh go héigeantach

source: If you reached pension age on or after 6 April 2002, you needed to have 260 full-rate contributions (effectively 5 years contributions but they do not need to be consecutive)
ga: Má shroicheann tú aois an phinsin ar nó i ndiaidh 6 Aibreán 2002, nár mhór duit 260 ranníocaíocht a bheith déanta agat (ranníocaíochtaí 5 bliana ach ní gá dóibh bheith comhleanúnacha)

source: If you reached pension age before 6 April 2002, you needed 156 qualifying full-rate contributions (a total of 3 years but they did not have to be consecutive)
ga: Má shroicheann tú aois an phinsin roimh 6 Aibreán 2002, nár mhór duit 156 ranníocaíocht a bheith déanta agat (ranníocaíochtaí 3 bliana ach ní gá dóibh bheith comhleanúnacha)

source: Note that social insurance contributions fall into the four groups below
ga: Bíonn ranníocaíochtaí árachais shóisialaigh roinnte ina gceithre ghrúpa thíos

source: • Full-rate social insurance contributions are PRSI contributions at Classes A, E, F, G, H, N and S or at the 'ordinary' rate before 6 April 1979
ga: • Is ionann ranníocaíochtaí árachais shóisialaigh ar lánráta agus ranníocaíochtaí ÁSPC in Aicmí A, E, F, G, H agus N nó ar 'ghnáthráta' roimh 6 Aibreán 1979

source: • Modified-rate social insurance contributions are PRSI contributions at Classes B, C and D (paid by civil and public servants)
ga: • Is ionann ranníocaíochtaí árachais shóisialaigh ar ráta mionathraithe agus ranníocaíochtaí ÁSPC in Aicmí B, C agus D (íoctha ag fostaithe sa tseirbhís phoiblí agus státseirbhísigh)

source: • Voluntary contributions are made by people under age 66 who are no longer covered by compulsory PRSI provided they satisfy certain conditions
ga: • Bíonn ranníocaíochtaí deonacha déanta ag daoine faoi bhun 66 bliain d'aois nach bhfuil cuimsithe faoi ÁSPC éigeantach a thuilleadh, fad is go sásaíonn siad coinníollacha áirithe

source: • Credited contributions ('credits') are similar to the social insurance contributions you pay while employed and are usually awarded at the same rate as your last paid social insurance contribution
ga: • Tá ranníocaíochtaí creidiúnaithe ('creidmheasanna') cosúil leis na ranníocaíochtaí árachais shóisialaigh a íocann tú nuair atá tú fostaithe agus is gnách go mbíonn siad bronnta ar an ráta céanna le do ranníocaíocht dheireanach íoctha árachais shóisialaigh

source: You may get credits when you are claiming a social welfare payment
ga: Is féidir leat creidmheasanna a fháil fad is atá íocaíocht leasa shóisialaigh á héileamh agat

source: Credits are not allowed after self-employed contributions (Class S)
ga: Ní cheadaítear creidmheasanna tar éis ranníocaíochtaí féinfhostaithe (Aicme S)

source: Average number of contributions per year
ga: Meán ranníocaíochtaí in aghaidh na bliana

source: You must meet the average condition
ga: Ní mór duit an mheánchoinníoll a shásamh

source: This is probably the most complex aspect of qualifying for a State Pension (Contributory)
ga: Is dócha gurb é seo an ghné is casta a bhaineann le cáiliú le pinsean a fháil agus an ceann is mó a chothaíonn fadhbanna agus aimhrialtachtaí

source: The normal average rule states that you must have a yearly average of at least 10 appropriate contributions paid or credited from the year you first entered insurance or from 1953, whichever is later to the end of the tax year before you reach pension age (66)
ga: De réir riail an ghnáthmheáin ní mór duit deich ranníocaíocht chuí ar a laghad a bheith déanta agat nó creidiúnaithe duit mar mheánráta bliantúil ón bhliain a ndeachaigh tú isteach sa scéim árachais, nó ó 1953 i leith (cibé acu is déanaí) suas go dtí deireadh an bhliain chánach sula sroicheann tú aois an phinsin (66). Má bhíonn 10 gcinn mar mheán-ráta bliantúil agat tá tú i dteideal an bunphinsean a fháil

source: An average of 10 entitles you to a minimum pension; you need an average of 48 to get the maximum pension
ga: Ní mór duit 48 gcinn a bheith agat mar mheán-ráta chun an phinsean iomlán a fháil

source: This alternative average only applies to people who reach pension age on or after 6 April 1992
ga: Ní bhaineann an meán malartach seo ach leo siúd a shroicheann aois an phinsin ar an 6 Aibreán 1992 nó ina dhiaidh

source: It requires that you have an average of 48 Class A, E, F, G, H, N or S contributions (paid or credited) for each contribution year from the 1979/80 tax year to the end of the tax year before you reach pension age (66)
ga: Dar réir na rialach seo ní mór duit 48 ranníocaíocht Rannóige A, E, F, G, H, N nó S a bheith déanta agat, nó creidiúnaithe duit, ar an meán in aghaidh gach bliain íocaíochta ó an bliain ranníoca 1979/80 suas go dtí an bhliain ranníoca dheiridh iomlán agus an bhliain sin san áireamh go dtí do 66ú breithlá

source: This average would entitle you to the maximum pension
ga: Dá mbeadh an mheánuimhir seo agat bheifeá i dteideal pinsean iomlán a fháil

source: There is no provision for a reduced pension when this alternative average is used
ga: Níl aon fhoráil ann pinsean níos lú a chur ar fáil nuair a úsáidtear an meán malartach seo

source: So, if you reach the age of 66 on or after April 6 1992, your average will be looked at in two ways - the usual average will be assessed and the alternative average will be assessed
ga: Mar sin, má bhíonn an 66 bliana slán agat ar an 6 Aibreán 1992, déanfar do mheánuimhir ranníocaíochtaí a mheas ar dhá bhealach - faoin ngnáthmheán agus faoin meán malartach

source: Most employed or formerly employed people will be able to meet the alternative average
ga: Beidh formhór d'fhostaithe agus d'iarfhostaithe na tíre in ann an meán malartach a shásamh

source: The alternative average will probably be looked at first because it is easier to assess
ga: Is dócha go ndéanfar an meán malartach a scrúdú ar dtús toisc gur fusa é a mheas

source: If you do not have an average of 48 contributions from 1979 then the normal method of assessing the average will be looked at and you may get a reduced pension (if you do not meet the alternative average, it is virtually impossible for you to have an average of 48 using the normal average rule)
ga: Mura bhfuil 48 ranníocaíocht déanta agat ar an mheán ó 1979 i leith déanfar an mheánuimhir a mheas ar an ngnáthbhealach agus b'fhéidir go bhfaighidh tú pinsean laghdaithe. (Mura n-éiríonn leat an meán malartach a shásamh beidh sé beagnach dodhéanta 48 acu a bheith agat mar mheán ar an ngnáthbhealach)

source: Working in the home and State pensions
ga: Ag obair sa bhaile agus pinsin Stáit

source: The Homemakers' Scheme makes it easier for people who stop working for a period to take care of children or adults to qualify for pensions
ga: I 1994, rinneadh rialacháin a bheadh sé a dhéanamh níos éasca cáiliú le haghaidh pinsean, do dhaoine a ghlacann saoire chun cúram do bhaill teaghlaigh a thabhairt

source: The scheme was introduced from 6 April 1994 and applies to anyone who provides full-time care for a child under age 12 or an ill or disabled person age 12 or over
ga: Baineann an Scéim um Chúramaí Baile le daoine a bhí ina gcúramóirí ó 1994 i leith

source: It does not apply to time spent caring before the introduction of the scheme
ga: Ní bhaineann sé leo siúd a bhí ina gcúramóirí roimh 1994 agus ní rachaidh sé chun tairbhe morán dóibh siúd a d'éirigh as a gcuid oibre go buan

source: It is most beneficial for people who work outside the home for a number of years and then spend a number of years as carers
ga: Baineann sé go háirithe leo siúd a bhí ag obair taobh amuigh den bhaile ar feadh roinnt blianta, a chaith roinnt blianta mar chúramóir agus d'fhill arís ar an obair taobh amuigh

source: It applies equally to women and men
ga: Baineann sé le fir agus le mná

source: From 6 April 1994, a contribution year spent as a homemaker may be disregarded in the calculation of the yearly average (see above) up to a maximum of 20 years. This has the effect of increasing your yearly average as the same number of total contributions are divided by a smaller number of years
ga: Ón 5ú Aibreán 1994 i leith is féidir neamh-aird a dhéanamh ar aon bhliain síntiúis (ach teorann 20 bliain leis) a chaith duine mar chúramóir baile, nuair atá comháireamh á dhéanamh ar an meán bliantúil

source: So, the fact that you do not have any contributions in those years will not reduce your yearly average and will make it easier for you to qualify for a State Pension (Contributory)
ga: Mar sin, cé nach bhfuil aon síntiúis íoctha agat ar na blianta sin, ní chuirfidh sé seo isteach ar do chuid cearta pinsin

source: There are a number of pro-rata pensions, which were introduced because of the exclusion of some people from the social insurance system at particular times
ga: Tá roinnt pinsean pro-rata ann a tugadh isteach toisc na bhfadhbanna agus na haimhrialtachatí a d'eascair ó fheidhmiú riail na meánuimhreacha ranníocaíochtaí agus toisc go raibh daoine áirithe eisiata ón gcóras árachais shóisialta ag uaireanta éagsúla

source: Pro-rata pension for mixed insurance
ga: Pinsean pro-rata le haghaidh árachas meascaithe

source: Pro-rata pensions were introduced for people with mixed insurance records
ga: Is iad ar déanadh socrú faoi phinsean dá-réir dóibh, ná iad siúd a raibh árachas measctha acu

source: Mixed insurance arises when a person spends part of his/her working life in the public service paying modified social insurance contributions and part in the private sector paying full rate social insurance contributions
ga: Thárlodh go mbeadh árachas measctha ag duine nuair a chaitheann sé/sí cuid dá s(h)aol ag obair sa tseirbhís póiblí agus ag íoc ranníocaíochtaí árachais shóisialaigh mionathraithe agus cuid eile dá s(h)aol sa rannóg phríobháideach ag íoc ranníocaíochtaí árachais shóisialaigh ag an ráta iomlán

source: Many people have had a career in both the public and private sector but do not have mixed insurance
ga: Tá daoine ann a bhí fostaithe sa rannóg phoiblí agus sa rannóg phríobháideach nach bhfuil árachas measctha acu

source: This is because no insurance was payable by people whose incomes were above certain limits before 1 April 1974
ga: Tharla sé seo de bhárr nach raibh gá do dhaoine a raibh a n-ioncam os cionn teorainn áirithe, aon árachas a íoc roimh ó 1 Aibreán 1974

source: Certain groups who are now insured were outside the scope of the system - Gardai are insurable since 1 April 1974; certain members of religious orders since 6 April 1988 and doctors and dentists in the civil service since 6 April 1988
ga: Bhí grúpaí áirithe atá anois ag íoc árachais, taobh amuigh den chóras-thosaigh Gárdaí ag íoc árachais ó Aibreán 1974; thosaigh baill áirithe de na hoird rialta á íoc ó Aibreán 1988 agus dochtúirí agus fiaclóirí sa stát sheirbhís ó Aibreán 1988

source: People with mixed insurance may have enough full rate contributions to enable them to qualify for a State Pension (Contributory)
ga: D'fhéadfadh go mbeadh a ndóthain ranníocaíochtaí ag an ráta iomlán ag daoine chun go mbéidís i dteideal Pinsean Stáit (Ranníocach)

source: This depends on the exact circumstances of each case
ga: Braitheann sé seo ar chuinsí gach cás ann féin

source: It could happen that one person would qualify while another, who might have more contributions, would not qualify
ga: D'fhéadfadh go mbeadh duine amháin i dteideal an phinsin agus nach mbeadh duine eile, in ainneoin níos mó ranníocaíochtaí a bheith ag an dara duine

source: Since 1991, a State Pension (Contributory) may be payable on a pro-rata basis to people with mixed insurance
ga: Ó 1991 i leith is féidir Pinsean Stáit (Ranníocach) a íoc ar bhonn pro rata le daoine a bhfuil árachas measctha acu

source: If you reach pension age on or after 6 April 2012, you need to have a total of at least 520 full-rate and modified rate contributions paid
ga: Má shroicheann tú aois a 66 ar nó tar éis 6 Aibreán 2012 caithfidh 520 ranníocaíocht idir an ráta iomlán agus an ráta mionathraithe a bheith agat

source: • At least 260 paid contributions at the full rate since entry into insurance or 1953, whichever is later
ga: • Ar a laghadh 260 ranníocaíochtaí a bheith íoctha nó curtha chun sochair duit ó chuaigh tú isteach in árachas nó ó 1953 pé acu is déanaí

source: • A mixture of full and modified contributions, which when added together give you a yearly average of 10 (for the State Pension Contributory) from the time you first entered insurance or 1953, whichever is later, to the end of the contribution year before your 66th birthday
ga: • Meascán de lán ranníocaíochtaí agus de ranníocaíochtaí laghdaithe a bheith agat a thugann, nuair a shuimítear iad meán bliantúil 10 ón am a ndeachaigh tú isteach in árachas ar dtús, nó ó 1953 pé acu is déanaí, go dtí deireadh na bliana ranníocaíochtaí roimh do 66ú breithlá

source: • Failed to qualify for a pension under EU regulations or under reciprocal arrangements with other countries or only qualified for a pension at a lower rate than this pro-rata pension would give you
ga: • Gur theip ort pinsean a fháil faoi rialacha an AE nó faoi shocrú cómhalartach le tíortha eile, nó go raibh tú i dteideal pinsean a bhí ar ráta níos ísle ná an ceann a bheadh agat de bhárr an phinsin dá-réir

source: If you meet all these requirements, you may qualify for a pension proportionate to the number of contributions that you have at the full rate
ga: Má chomhlíonann tú na riachtanais seo ar fad, d'fhéadfá a bheith i dteideal pinsean a bheadh i gcomhréir leis an méid ranníocaíochtaí a bhí íoctha agat ag an ráta iomlán

source: To take a very simple example, if you worked for 40 years up to age 66 and 10 of those were in the private sector, you would get one-quarter of the normal pension
ga: Tóg sampla an-simplí, má bhí tú ag obair ar feadh 40 bliain suas go dtí aois a 66 agus gur chaith tú deich mbliana acu sin sa rannóg phríobháideach is aon ceathrú den ghnáth phinsean a bheadh ag dul duit

source: The amount paid is in proportion to your full-rate contributions as a percentage of your overall contributions
ga: Tá an méid íoctha i gcomhréir do ranníocaíochtaí ag an ráta iomlán mar chéatadán iomlán do ranníocaíochtaí

source: To calculate your pension you add contributions at the full and modified rates together
ga: Chun do phinsean a ríomh, suimítear le chéile na ranníocaíochtaí a bhí íoctha ag an ráta iomlán agus ag an ráta mionathraithe

source: The average is then measured in the normal way
ga: Déantar an meán a thomhais ar an ngnáth bhealach, ansin

source: If you have an average of at least 10 then you may qualify
ga: Má tá 10 ranníocaíocht ar an meán agat d'fhéadfá a bheith i dteideal an phinsin

source: Then the number of full rate contributions is divided by the total number of contributions to find out what proportion are full rate; you then get that proportion of the pension
ga: Ansin roinntear an líon ranníocaíochtaí atá agat ag an ráta iomlán ar an líon iomlán ranníocaíochtaí chun a fháil amach cén codán acu atá ag an ráta iomlán

source: The Increase for a Qualified Adult payable with this pension is proportioned as well
ga: Bíonn an Méadú do Dhuine Fásta Cáilithe, a théann leis an bpinsean seo, comhréireach freisin

source: Pro-rata pension for intermittent insurance
ga: Pinsin pro-rata d'árachas uaineach

source: This pension applied to people with intermittent insurance and who had a yearly average of under 10
ga: Baineann an pinsean seo le daoine atá árachas uaineach acu le meánuimhir bliantúil 10 nó níos lú

source: It no longer applies to new applicants (from January 2013)
ga: Ní bhaineann sé le hiarratasóirí nua a thuilleadh (ó Eanáir 2013)
